org/lrn/lisp/lisp-1.org
#+STARTUP: showall indent hidestars

* План работ

Теперь добавим к нашей реализации окружения. Для этого, у ~myeval~ появляется еще один
параметр ~env~. В параметре ~env~ передается окружение, которое у нас будет реализовано
как ассоциативный список вида:

#+BEGIN_SRC lisp
  ((a . 1) (b . 42) (c . somesymbol))
#+END_SRC

Таким образом, ~myeval~ становится таким:

#+BEGIN_SRC lisp
  (defun myeval (lst env)
    (cond
      ;; Какие-то действия в зависимости от того какая форма
      ;; ...
      (t (error 'unknown-form))))
#+END_SRC

Соотвественно все вызовы ~myeval~ изменяются, чтобы использовать ~env~

* Самовычисляемые формы

Здесь ничего не меняется

#+NAME: number_1
#+BEGIN_SRC lisp
  ((null lst)                  nil)
  ((numberp lst)               lst)
#+END_SRC

* Встроенные функции арифметики

Вызов ~my-eval~ использует дополнительный параметр ~env~

#+NAME: ariph_1
#+BEGIN_SRC lisp
  ((equal (car lst) '+)        (+ (myeval (cadr lst) env)
                                  (myeval (caddr lst) env)))
  ((equal (car lst) '*)        (* (myeval (cadr lst) env)
                                  (myeval (caddr lst) env)))
#+END_SRC

К старым тестам (изменным, чтобы принимать пустое окружение) добавляем новые, которые
используют окружение, которое пока мы формируем вручную

#+NAME: ariph_1_test
#+BEGIN_SRC lisp
  (assert (equal 7 (myeval 7 nil)))
  (assert (equal 3 (myeval '(+ 1 2) nil)))
  (assert (equal 21 (myeval '(* (+ 1 2) (+ 3 4)) nil)))
  (assert (equal 2 (myeval 'a '((a . 2)))))
  (assert (equal 47 (myeval '(+ a b) '((a . 45) (b . 2)))))
#+END_SRC

* Цитирование

Без изменений

#+NAME: quote_1
#+BEGIN_SRC lisp
  ((equal (car lst) 'quote)    (cadr lst))
#+END_SRC

Без изменений

#+NAME: quote_1_test
#+BEGIN_SRC lisp
  (assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil)))
#+END_SRC

* Работа с CONS-ячейками

Добавляем параметр

#+NAME: car_cdr_cons_1
#+BEGIN_SRC lisp
  ((equal (car lst) 'car)      (car (myeval (cadr lst) env)))
  ((equal (car lst) 'cdr)      (cdr (myeval (cadr lst) env)))
  ((equal (car lst) 'cons)     (cons (myeval (cadr lst) env)
                                     (myeval (caddr lst) env)))
#+END_SRC

Добавляем тесты, которые работают с cons-ячейками, полученными из окружения

#+NAME: car_cdr_cons_1_test
#+BEGIN_SRC lisp
  (assert (equal '(1 . 2) (myeval '(cons 1 2) nil)))
  (assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
  (assert (equal 2 (myeval '(car (cons 2 3)) nil)))
  (assert (equal 3 (myeval '(cdr (cons 2 3)) nil)))
  (assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
  (assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
  (assert (equal 1 (myeval '(car a) '((a . (1 . 2))))))
  (assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
  (assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
#+END_SRC

* NULL-предикат

Без изменений

#+NAME: null_1
#+BEGIN_SRC lisp
  ((equal (car lst) 'null)     (null (myeval (cadr lst) env)))
#+END_SRC

Добавляем тесты, проверящие символ в окружении, равный nil и не nil

#+NAME: null_1_test
#+BEGIN_SRC lisp
  (assert (equal T (myeval '(null ()) nil)))
  (assert (equal T (myeval '(null a)) '((a . ()))))
  (assert (equal NIL (myeval '(null a)) '((a . 1))))
#+END_SRC

* Условное выполнение IF

Без изменений

#+NAME: if_1
#+BEGIN_SRC lisp
  ((equal (car lst) 'if)       (if (myeval (cadr lst) env)
                                   (myeval (caddr lst) env)
                                   (myeval (cadddr lst) env)))
#+END_SRC

Добавляем тесты, где условие вычисляется с использованием окружения

#+NAME: if_1_test
#+BEGIN_SRC lisp
  (assert (equal 2 (myeval '(if () 1 2) nil)))
  (assert (equal 1 (myeval '(if (null ()) 1 2) nil)))
  (assert (equal 2 (myeval '(if a 1 2) '((a . ())))))
  (assert (equal 1 (myeval '(if a 1 2) '((a . 1)))))
#+END_SRC

* COND

Без изменений

#+NAME: evcond_1
#+BEGIN_SRC lisp
  (defun evcond (lst env)
    (cond ((null lst)               nil)
          ((myeval (caar lst) env)  (myeval (cadar lst) env))
          (t                        (evcond (cdr lst) env))))
#+END_SRC

Без изменений

#+NAME: cond_1
#+BEGIN_SRC lisp
  ((equal (car lst) 'cond)     (evcond (cdr lst) env))
#+END_SRC

Добавляем тесты для окружений

#+NAME: cond_1_test
#+BEGIN_SRC lisp
  (assert (equal 2 (myeval '(cond
                             (() 1)
                             (1 2))
                           nil)))
  (assert (equal 2 (myeval '(cond
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1)))))
  (assert (equal 1 (myeval '(cond
                             (a 1)
                             (b 2))
                           '((a . 1) (b . ())))))
#+END_SRC

