www/lrn/lisp/lisp-1.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-3">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-4">Цитирование</a></li>
<li><a href="#unnumbered-5">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-6">NULL-предикат</a></li>
<li><a href="#unnumbered-7">Условное выполнение IF</a></li>
<li><a href="#unnumbered-8">COND</a></li>
<li><a href="#unnumbered-9">PROGN</a></li>
<li><a href="#unnumbered-10">PRINT</a></li>
<li><a href="#unnumbered-11">LIST</a></li>
<li><a href="#unnumbered-12">Вычисление символов</a></li>
<li><a href="#unnumbered-13">LET</a></li>
<li><a href="#unnumbered-14">LET*</a></li>
<li><a href="#unnumbered-15">LAMBDA</a></li>
<li><a href="#unnumbered-16"><span class="todo nilTODO">TODO</span> AND</a></li>
<li><a href="#unnumbered-17"><span class="todo nilTODO">TODO</span> OR</a></li>
<li><a href="#unnumbered-18">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Теперь добавим к нашей реализации окружения. Для этого, у <code>myeval</code> появляется еще один
параметр <code>env</code>. В параметре <code>env</code> передается окружение, которое у нас будет реализовано
как ассоциативный список вида:
</p>

<div class="org-src-container">

<pre class="src src-lisp">((a . 1) (b . 42) (c . somesymbol))
</pre>
</div>

<p>
Таким образом, <code>myeval</code> становится таким:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1050;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">...</span>
    (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-form))))
</pre>
</div>

<p>
Соотвественно все вызовы <code>myeval</code> изменяются, чтобы использовать <code>env</code>
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Самовычисляемые формы</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Здесь ничего не меняется
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="number_1">((null lst)                  nil)
((numberp lst)               lst)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Встроенные функции арифметики</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Вызов <code>my-eval</code> использует дополнительный параметр <code>env</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="ariph_1">((equal (car lst) '+)        (+ (myeval (cadr lst) env)
                                (myeval (caddr lst) env)))
((equal (car lst) '*)        (* (myeval (cadr lst) env)
                                (myeval (caddr lst) env)))
</pre>
</div>

<p>
К старым тестам (изменным, чтобы принимать пустое окружение) добавляем новые, которые
используют окружение, которое пока мы формируем вручную
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="ariph_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 7 (myeval 7 nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(+ 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 21 (myeval '(* (+ 1 2) (+ 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval 'a '((a . 2)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 47 (myeval '(+ a b) '((a . 45) (b . 2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Цитирование</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="quote_1">((equal (car lst) 'quote)    (cadr lst))
</pre>
</div>

<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="quote_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Работа с CONS-ячейками</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<p>
Добавляем параметр
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="car_cdr_cons_1">((equal (car lst) 'car)      (car (myeval (cadr lst) env)))
((equal (car lst) 'cdr)      (cdr (myeval (cadr lst) env)))
((equal (car lst) 'cons)     (cons (myeval (cadr lst) env)
                                   (myeval (caddr lst) env)))
</pre>
</div>

<p>
Добавляем тесты, которые работают с cons-ячейками, полученными из окружения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="car_cdr_cons_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-2">
<h2 id="unnumbered-6">NULL-предикат</h2>
<div class="outline-text-2" id="text-unnumbered-6">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="null_1">((equal (car lst) 'null)     (null (myeval (cadr lst) env)))
</pre>
</div>

<p>
Добавляем тесты, проверящие символ в окружении, равный nil и не nil
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="null_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null ()) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null a)) '((a . ()))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a)) '((a . 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">Условное выполнение IF</h2>
<div class="outline-text-2" id="text-unnumbered-7">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="if_1">((equal (car lst) 'if)       (<span style="color: #af00ff;">if</span> (myeval (cadr lst) env)
                                 (myeval (caddr lst) env)
                                 (myeval (cadddr lst) env)))
</pre>
</div>

<p>
Добавляем тесты, где условие вычисляется с использованием окружения
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="if_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . ())))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . 1)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">COND</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evcond_1">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)               nil)
        ((myeval (caar lst) env)  (myeval (cadar lst) env))
        (t                        (evcond (cdr lst) env))))
</pre>
</div>

<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="cond_1">((equal (car lst) 'cond)     (evcond (cdr lst) env))
</pre>
</div>

<p>
Добавляем тесты для окружений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="cond_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2))
                         nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                         (a 1)
                         (b 2))
                       '((a . ()) (b . 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ())))))
</pre>
</div>
</div>
</div>
