www/lrn/lisp/lisp-1.html

<div id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">PROGN</h2>
<div class="outline-text-2" id="text-unnumbered-9">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evprogn_1">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)        nil)
        ((null (cdr lst))  (myeval (car lst) env))
        (t                 (myeval (car lst) env)
                           (evprogn (cdr lst) env))))
</pre>
</div>

<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="progn_1">((equal (car lst) 'progn)    (evprogn (cdr lst) env))
</pre>
</div>

<p>
Добавляем тесты в окружении
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="progn_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> a b c) '((a . 1) (b . 2) (c . 3)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-2">
<h2 id="unnumbered-10">PRINT</h2>
<div class="outline-text-2" id="text-unnumbered-10">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="print_1">((equal (car lst) 'print)    (print (myeval (cadr lst)  env)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-2">
<h2 id="unnumbered-11">LIST</h2>
<div class="outline-text-2" id="text-unnumbered-11">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_1">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)  nil)
        (t           (cons (myeval (car lst) env)
                     (evlis (cdr lst) env)))))
</pre>
</div>

<p>
Добавляем тесты в окружении
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ a b) (* b c) 42) '((a . 1) (b . 2) (c . 3) (d . 4)))))
</pre>
</div>

<p>
LIST определяем почти без изменений:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="list_1">((equal (car lst) 'list)     (evlis (cdr lst) env))
</pre>
</div>

<p>
Протестируем <code>list</code> (добавляя тесты в окружении)
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="list_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ a b) (* b c) 42)
                       '((a . 1) (b . 2) (c . 3) (d . 4)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-12" class="outline-2">
<h2 id="unnumbered-12">Вычисление символов</h2>
<div class="outline-text-2" id="text-unnumbered-12">
<p>
С этого момента мы начинаем расширять возможности интерпретатора.
</p>

<p>
Если мы встречаем символ, то мы должны найти его в нашем окружении. Мы можем достичь
этого следующим образом:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="symb_1">((symbolp lst)               (cdr (assoc lst env)))
</pre>
</div>

<p>
Важно поместить этот кусок ближе к началу <code>myeval</code>, чтобы избежать попыток выполнять
над символом те операции, которые выполняются над списковыми формами.
</p>

<p>
Протестируем
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="symb_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-13" class="outline-2">
<h2 id="unnumbered-13">LET</h2>
<div class="outline-text-2" id="text-unnumbered-13">
<p>
Теперь мы можем заняться более сложной частью - работой с окружениями. Чтобы добавить
переменную в окружение нам понадобятся вспомогательных функции. Первая из них: EVLIS
(Evaluate List) уже у нас есть (мы определили ее в разделе, где определен LIST).
</p>

<p>
Вторая вспомогательная функция: PAIRLIS. Мы будем использовать ее для работы с
окружениями. Она принимает список ключей <code>lst1</code>, список значений <code>lst2</code> и ассоциативный
список результатов <code>alist</code>. В процессе своей работы из первых двух списков она
формирует пары "ключ-значение" и добавляет их в <code>alist</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="mypairlis_example">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
 (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
       ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error))
       (t                               (mypairlis (cdr lst1)
                                                   (cdr lst2)
                                                   (cons (cons (car lst1)
                                                               (car lst2))
                                                         alist)))))
</pre>
</div>

<p>
Вариант с хвостовой рекурсией будет эффективнее. Кроме того есть различие в семантике,
которое проявляется, если разрешены дубли в lambda-list. Если дубли запрещены, то
неважно, какой <code>pairlis</code> использовать.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="mypairlis_1">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
  (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
</pre>
</div>

<p>
Протестируем <code>mypairlis</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="mypairlis_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
</pre>
</div>

<p>
Имея эти функции мы можем определить LET:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="let_1">((equal (car lst) 'let)      (evprogn (cddr lst) <span style="color: #af0000;">; implicit progn</span>
                                      (pairlis (mapcar #'car
                                                       (car (cdr lst)))
                                               (evlis (mapcar #'cadr
                                                              (car (cdr lst)))
                                                      env)
                                               env)))
</pre>
</div>

<p>
и проверить его:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="let_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(<span style="color: #af00ff;">let</span> ((a 1)
                                       (b 2))
                                  (cons a b)) nil)))
</pre>
</div>
</div>
</div>
