www/lrn/lisp/lisp-1.html

<div id="outline-container-unnumbered-14" class="outline-2">
<h2 id="unnumbered-14">LET*</h2>
<div class="outline-text-2" id="text-unnumbered-14">
<p>
Определение LET* потребует одну дополнительную функцию, которую назовем EVLETSTAR. Она
принимает три аргумента. Первый, <code>varpairs</code>, представляет собой пары "ключ-значение",
которые на каждом шаге по одной будут добавлены в окружение <code>env</code>. Второй параметр,
<code>EXP</code>, представляет собой тело выражения, которое должно быть вычислено, когда все
varpairs будут добавлены в окончательное окружение.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evletstar_1">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evletstar</span> (varpairs exp env)
  (<span style="color: #af00ff;">cond</span> ((null varpairs)  (myeval exp env))
        (t                (evletstar (cdr varpairs)
                                     exp
                                     (cons (cons (caar varpairs)
                                                 (myeval (cadar varpairs) env))
                                           env)))))
</pre>
</div>

<p>
Теперь мы можем определить LET*:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="letstar_1">((equal (car lst) 'let*)     (evletstar (cadr lst)
                                        (caddr lst)
                                        env))
</pre>
</div>

<p>
и протестировать его:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="letstar_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 1 . 2) (myeval '(<span style="color: #af00ff;">let*</span> ((a 1)
                                          (b 2)
                                          (c (+ a b)))
                                    (cons c (cons a b))) nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-2">
<h2 id="unnumbered-15">LAMBDA</h2>
<div class="outline-text-2" id="text-unnumbered-15">
<p>
Последняя форма, которую мы реализуем - LAMBDA. В нашем интерпретаторе она вычисляется
при вызове, являясь первым аргументом вычисляемого списка: <code>((lambda (x) (cons x x))
42)</code> Кроме того, LAMBDA формирует свое окружение из своих параметров:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lambda_1">((equal (caar lst) 'lambda)  (myeval (car (cddar lst))
                                     (pairlis (cadar lst)
                                              (evlis (cdr lst) env)
                                              env)))
</pre>
</div>

<p>
Проверим работу LAMBDA:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lambda_1_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 42) (myeval '((<span style="color: #af00ff;">lambda</span> (x)
                                      (cons x x))
                                    42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 17) (myeval '((<span style="color: #af00ff;">lambda</span> (x y)
                                      (cons x y))
                                    42 17) nil)))
</pre>
</div>
</div>
</div>
