www/lrn/lisp/lisp-1.html

<div id="outline-container-unnumbered-16" class="outline-2">
<h2 id="unnumbered-16"><span class="todo TODO">TODO</span> AND</h2>
</div>
<div id="outline-container-unnumbered-17" class="outline-2">
<h2 id="unnumbered-17"><span class="todo TODO">TODO</span> OR</h2>
</div>
<div id="outline-container-unnumbered-18" class="outline-2">
<h2 id="unnumbered-18">Итоги</h2>
<div class="outline-text-2" id="text-unnumbered-18">
<p>
Соберем простой интерпретатор из <code>myeval</code> и вспомогательных функций и запишем его файл:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="simple">&lt;&lt;evcond_1&gt;&gt;
&lt;&lt;evprogn_1&gt;&gt;
&lt;&lt;evlis_1&gt;&gt;
&lt;&lt;mypairlis_1&gt;&gt;
&lt;&lt;evletstar_1&gt;&gt;
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;number_1&gt;&gt;
    &lt;&lt;symb_1&gt;&gt;
    &lt;&lt;ariph_1&gt;&gt;
    &lt;&lt;quote_1&gt;&gt;
    &lt;&lt;car_cdr_cons_1&gt;&gt;
    &lt;&lt;null_1&gt;&gt;
    &lt;&lt;if_1&gt;&gt;
    &lt;&lt;cond_1&gt;&gt;
    &lt;&lt;progn_1&gt;&gt;
    &lt;&lt;print_1&gt;&gt;
    &lt;&lt;list_1&gt;&gt;
    &lt;&lt;let_1&gt;&gt;
    &lt;&lt;letstar_1&gt;&gt;
    &lt;&lt;lambda_1&gt;&gt;
    (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-form))))

&lt;&lt;symb_1_test&gt;&gt;
&lt;&lt;ariph_1_test&gt;&gt;
&lt;&lt;quote_1_test&gt;&gt;
&lt;&lt;car_cdr_cons_1_test&gt;&gt;
&lt;&lt;if_1_test&gt;&gt;
&lt;&lt;cond_1_test&gt;&gt;
&lt;&lt;evlis_1_test&gt;&gt;
&lt;&lt;list_1_test&gt;&gt;
&lt;&lt;mypairlis_1_test&gt;&gt;
&lt;&lt;let_1_test&gt;&gt;
&lt;&lt;letstar_1_test&gt;&gt;
&lt;&lt;lambda_1_test&gt;&gt;
</pre>
</div>

<p>
Мы должны получить следующий результат:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)               nil)
        ((myeval (caar lst) env)  (myeval (cadar lst) env))
        (t                        (evcond (cdr lst) env))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)        nil)
        ((null (cdr lst))  (myeval (car lst) env))
        (t                 (myeval (car lst) env)
                           (evprogn (cdr lst) env))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst) nil)
        (t (cons (myeval (car lst) env)
                 (evlis (cdr lst) env)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
  (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evletstar</span> (varpairs exp env)
  (<span style="color: #af00ff;">cond</span> ((null varpairs)  (myeval exp env))
        (t                (evletstar (cdr varpairs)
                                     exp
                                     (cons (cons (caar varpairs)
                                                 (myeval (cadar varpairs) env))
                                           env)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    ((null lst)                  nil)
    ((numberp lst)               lst)
    ((symbolp lst)               (cdr (assoc lst env)))
    ((equal (car lst) '+)        (+ (myeval (cadr lst) env)
                                    (myeval (caddr lst) env)))
    ((equal (car lst) '*)        (* (myeval (cadr lst) env)
                                    (myeval (caddr lst) env)))
    ((equal (car lst) 'quote)    (cadr lst))
    ((equal (car lst) 'car)      (car (myeval (cadr lst) env)))
    ((equal (car lst) 'cdr)      (cdr (myeval (cadr lst) env)))
    ((equal (car lst) 'cons)     (cons (myeval (cadr lst) env)
                                       (myeval (caddr lst) env)))
    ((equal (car lst) 'null)     (null (myeval (cadr lst) env)))
    ((equal (car lst) 'if)       (<span style="color: #af00ff;">if</span> (myeval (cadr lst) env)
                                     (myeval (caddr lst) env)
                                     (myeval (cadddr lst) env)))
    ((equal (car lst) 'cond)     (evcond (cdr lst) env))
    ((equal (car lst) 'progn)    (evprogn (cdr lst) env))
    ((equal (car lst) 'print)    (print (myeval (cadr lst)  env)))
    ((equal (car lst) 'list)     (evlis (cdr lst) env))
    ((equal (car lst) 'let)      (evprogn (cddr lst) <span style="color: #af0000;">; implicit progn</span>
                                          (pairlis (mapcar #'car
                                                           (car (cdr lst)))
                                                   (evlis (mapcar #'cadr
                                                                  (car (cdr lst)))
                                                          env)
                                                   env)))
    ((equal (car lst) 'let*)     (evletstar (cadr lst)
                                            (caddr lst)
                                            env))
    ((equal (caar lst) 'lambda)  (myeval (car (cddar lst))
                                         (pairlis (cadar lst)
                                                  (evlis (cdr lst) env)
                                                  env)))
    (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-form))))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 7 (myeval 7 nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(+ 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 21 (myeval '(* (+ 1 2) (+ 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval 'a '((a . 2)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 47 (myeval '(+ a b) '((a . 45) (b . 2)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . ())))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2))
                         nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ())))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ a b) (* b c) 42) '((a . 1) (b . 2) (c . 3) (d . 4)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ a b) (* b c) 42)
                       '((a . 1) (b . 2) (c . 3) (d . 4)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(<span style="color: #af00ff;">let</span> ((a 1)
                                       (b 2))
                                  (cons a b)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 1 . 2) (myeval '(<span style="color: #af00ff;">let*</span> ((a 1)
                                          (b 2)
                                          (c (+ a b)))
                                    (cons c (cons a b))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 42) (myeval '((<span style="color: #af00ff;">lambda</span> (x)
                                      (cons x x))
                                    42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 17) (myeval '((<span style="color: #af00ff;">lambda</span> (x y)
                                      (cons x y))
                                    42 17) nil)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
